src/cfe/prometheus_client/InformationRegisters/PrometheusДанныеРеестра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>PrometheusДанныеРеестра</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеКоллектора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяКоллектора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/prometheus_client/CommonModules/PrometheusRegistryStorage/Ext/Module.bsl
// Хранение реестра по умолчанию (e1c) в регистре сведений PrometheusДанныеРеестра.
// Одна запись регистра = один коллектор, ключ записи - ИмяКоллектора.
//
// Возвращаемое значение:
//   Структура - реестр с ключом Коллекторы (массив).
Функция ПолучитьРеестр() Экспорт
	Реестр = PrometheusCollectorRegistry.СоздатьРеестр();

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	PrometheusДанныеРеестра.ИмяКоллектора КАК ИмяКоллектора,
		|	PrometheusДанныеРеестра.ДанныеКоллектора КАК ДанныеКоллектора
		|ИЗ
		|	РегистрСведений.PrometheusДанныеРеестра КАК PrometheusДанныеРеестра");

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ТипЗнч(Выборка.ДанныеКоллектора) = Тип("ХранилищеЗначения") Тогда
			Продолжить;
		КонецЕсли;

		Коллектор = Выборка.ДанныеКоллектора.Получить();
		Если Коллектор = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		PrometheusRegistry.Зарегистрировать(Реестр, Коллектор);
	КонецЦикла;

	ДополнитьВстроеннымиМетриками(Реестр);

	Возврат Реестр;
КонецФункции

// Создаёт новый реестр и добавляет встроенные метрики (prometheus_client_up, prometheus_client_http_requests_total).
//
// Возвращаемое значение:
//   Структура - реестр с ключом Коллекторы (массив).
Функция СоздатьРеестрСВстроеннойМетрикой()
	Реестр = PrometheusCollectorRegistry.СоздатьРеестр();
	ДобавитьВстроенныеМетрикиВРеестр(Реестр);

	Возврат Реестр;
КонецФункции

// Добавляет prometheus_client_up и prometheus_client_http_requests_total в реестр, если их ещё нет. 
// После изменений сохраняет реестр.
//
// Параметры:
//   Реестр - Структура - реестр с ключом Коллекторы (массив).
Процедура ДополнитьВстроеннымиМетриками(Реестр)
	ЕстьAppUp = Ложь;
	ЕстьСчетчикЗапросов = Ложь;
	Для Каждого Коллектор Из Реестр.Коллекторы Цикл
		Если ТипЗнч(Коллектор) = Тип("Структура") И Коллектор.Свойство("Имя") Тогда
			Если Коллектор.Имя = "prometheus_client_up" Тогда
				ЕстьAppUp = Истина;
			КонецЕсли;
			Если Коллектор.Имя = "prometheus_client_http_requests_total" Тогда
				ЕстьСчетчикЗапросов = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ЕстьAppUp И ЕстьСчетчикЗапросов Тогда
		Возврат;
	КонецЕсли;

	ДобавитьВстроенныеМетрикиВРеестр(Реестр);
	СохранитьРеестр(Реестр);
КонецПроцедуры

// Добавляет в реестр метрики prometheus_client_up (gauge 1) 
// и prometheus_client_http_requests_total (counter с лейблом handler). 
// Не сохраняет.
//
// Параметры:
//   Реестр - Структура - реестр с ключом Коллекторы.
Процедура ДобавитьВстроенныеМетрикиВРеестр(Реестр)
	Если НайтиКоллекторПоИмени(Реестр, "prometheus_client_up") = Неопределено Тогда
		ИндикаторПриложения = PrometheusMetrics.НовыйИндикатор(
			Новый Структура("Имя, Справка", "prometheus_client_up", "Клиент Prometheus: приложение отвечает (1)"));
		PrometheusMetrics.УстановитьИндикатор(ИндикаторПриложения, 1);
		PrometheusRegistry.Зарегистрировать(Реестр, ИндикаторПриложения);
	КонецЕсли;

	Если НайтиКоллекторПоИмени(Реестр, "prometheus_client_http_requests_total") = Неопределено Тогда
		ЛейблыЗапросов = Новый Соответствие;
		ЛейблыЗапросов.Вставить("handler", "/metrics");
		ОпцииСчетчик = Новый Структура(
			"Имя, Справка",
			"prometheus_client_http_requests_total",
			"Число HTTP-запросов к эндпоинту выдачи метрик");
		ОпцииСчетчик.Вставить("КонстантныеЛейблы", ЛейблыЗапросов);
		СчетчикЗапросов = PrometheusMetrics.НовыйСчетчик(ОпцииСчетчик);
		PrometheusRegistry.Зарегистрировать(Реестр, СчетчикЗапросов);
	КонецЕсли;
КонецПроцедуры

// Ищет в реестре коллектор с заданным именем.
//
// Параметры:
//   Реестр - Структура - реестр с ключом Коллекторы (массив).
//   Имя - Строка - имя метрики (например, "prometheus_client_up").
//
// Возвращаемое значение:
//   Структура, Неопределено - коллектор или Неопределено.
Функция НайтиКоллекторПоИмени(Реестр, Имя)
	Для Каждого Коллектор Из Реестр.Коллекторы Цикл
		Если ТипЗнч(Коллектор) = Тип("Структура") И Коллектор.Свойство("Имя") И Коллектор.Имя = Имя Тогда
			Возврат Коллектор;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;
КонецФункции

// Сохраняет реестр в регистр сведений PrometheusДанныеРеестра.
//
// Параметры:
//   Реестр - Структура - реестр с ключом Коллекторы.
Процедура СохранитьРеестр(Реестр) Экспорт
	НаборЗаписей = РегистрыСведений.PrometheusДанныеРеестра.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	Для Каждого Коллектор Из Реестр.Коллекторы Цикл
		Если НЕ ТипЗнч(Коллектор) = Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ Коллектор.Свойство("Имя") Тогда
			Продолжить;
		КонецЕсли;

		Запись = НаборЗаписей.Добавить();
		Запись.ИмяКоллектора = Коллектор.Имя;
		Запись.ДанныеКоллектора = Новый ХранилищеЗначения(Коллектор);
	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры
